### 2.1简介

​       在记录联系中（Fellegi和Sunter，1969年;Herzog等人，2007年），也称为实体或共同参考决议（Christen，2012年），其目的是将记录（与相关观察结果）识别并合并到单独的文件中，它们对应于相同的实体（或单元）。除非存在允许精确匹配的唯一标识符，当链接的记录实际上并未引用同一实体，或者未能链接引用同一实体的记录时，链接错误是不可避免的。
$$
表2.1
\space \space 2011年英国人口普查汇总和患者等级链接\\
\begin{array}
{cll}
\hline
	类型  & 通过  & 链接数 & 错误链接率 \\
\hline
	确定性的 &1&30780660   & 0.00011 \\
	        &2&11733197   &0.00389 \\
	        &3&1513471    & 0.00561 \\
	        &4&2444838    & 0.00375\\
	        &5&1346432    &0.00748\\
	        &6&121483     &0.00886\\
	        &7&1007293    &0.00100\\
	        &8&825069     &0.01485\\
	        &9&35432      &0.00100\\
\hline
概率性的&1&511239&0.02948\\
       &2&298645&0.07165\\
\hline
全部的& & &50617759\\
\hline
\end{array}
$$
​       表2.1提供了国家统计局（ONS）开展的2011年英格兰人口普查和患者登记（C-PR)联系的汇总。详见Owen等。（2015）关于基本方法的一些相关方面。是一个过程中的每一个都使用匹配（或关键）变量的不同组合，包括姓名、出生日期、性别、邮政编码等。最后，大约300万人口普查记录没有与患者登记册链接，而所有链接的记录都不是真是匹配的，如在不同通过处的估计错误链接率（FLR）所指示的。

​      二级分析员如何根据C-PR关联数据进行有效分析？这是我们在这里考虑的问题。有两个条件有助于澄清二级分析师的立场。一方面，可以有把握地假设二级分析师不能直接访问所有关键变量和单独的数据文件，也没有复制实际链接程序的详细知识或工具。例如，姓名、出生日期和邮政编码都用于C-PR链接，但出于隐私保护，这些数据不太可能被发布给二级分析师。另一方面，还必须假设可以提供一些关于记录如何实际相互比较的非公开链接比较数据。这对于允许任何其他可能性而不是按原样分析链接数据集是必要的；例如，参见Gilbert等人（2017）关于用于数据链接的信息交换协议。例如，可以为一对链接记录分配一个分数，以反映它们在关键变量方面的一致性。

#### 2.1.1 相关工作

​       当涉及到由于链接误差传播不确定性的记录链接数据分析时，可以在文献中辨别出不同的方法。不幸的是，现有的方法都不能充分解决上述二次分析的问题。

​        几乎所有的频繁方法都是基于一个数据集中的记录的概率的链接模型。Scheuren和Winkler(1993,1997)、Lahir和larsen(2005)、Chambers(2009)、Chipperfield和Chambers(2015)使用Monte Carlo模拟两个数据集之间的一致模式和后续记录链接过程来估计链接模型。该方法仅限于能够访问所有关键变量和实际链接过程的人员。因此，二级分析师将不得不采用大大简化的假设，如分庭的可交换链接错误模型（2009年），或采用特别办法。例如，Hof和Zwinderman（2015）假设要链接的两个数据集中的每对记录独立贡献成对为伪似然。但目前还不清楚这种伪概率如何产生有效的推论。

​        对于贝叶斯框架下的记录链接和分析，可以参考Tancredi和Liseo（2011），Gutman等人（2013）、Sadinle（2014）和 Stoerts等人（2016）等。推理基于匹配数据集的后验分布。观察到的关键变量的建模方法，如Stoerts等人所述。（2016），建立在Copas和Hilton（1990）的撞中模式。然而，失真模型适用于次要分析人员无法访问的关键变量，除非在特殊情况下。将大量后验匹配数据集分发给二级分析师可能并不总是切实可行的，也不能像C-PR案例中那样扩展到大型数据集。

​      Goldstein等人(2012)应用多重插补，其中被接受为正确链接的单元具有完整的观察结果，而其他记录对应的单元被认为具有缺失的观察结果。Gutman等人（2015）采用不同的方法对链接的记录对进行乘法插补，无论它们是否为真匹配，其中假定未链接的真匹配随机丢失。应该注意的是，这些估算方法不受底层链接数据结构的限制。例如，链接的记录是否为真匹配将影响其他记录对是否可能为真匹配。这些插补方法中没有内置类似这样的限制。

####  2.1.2勘察情况

​      我们将在续集中研究三种不同的方法。我们在第2.3节考虑了感兴趣参数的最大似然估计（MLE）。这基于这样一个概念，即比较数据是根据概率模型产生的，包括可能导致链接误差的关键变量真实值的失真。然而，它将会被证明，基于"链接数据结构"（详见第2.2节）模型的MLE一般不简单。讨论涉及到从二元正态变量的破碎随机样本对相关系数的MLE分析（DeGroot和Goel,1980).

​      接下来，使用线性回归作为案例，我们在第2.4节中考虑无偏回归估计，条件是可用的比较数据，并将其与现有的频繁方法（例如，Lahiri和Larsen, 2005）。本文概述了一种适用于常见的概率性和确定性记录链接过程的比较数据建模方法，并讨论了C-PR案例中的可扩展性问题。我们发现，对于这种重量级的数据集，旨在使用所有记录的有效分析是极其不切实际的。

​      第三种方法包括仅利用具有几乎零 FLR的链路，以及基于所产生的链路子集针对剩余的错误链路和缺失的真匹配来调整所述分析。虽然这显然会导致效率的损失，但在诸如C-PR链接，其中仍然可以获得大的精确数据集，例如在估计的FLR大约为一万分之一的情况下，从第一次通过获得3000万条记录。当所有链路都是真匹配时，调整问题就变成了数据丢失问题。虽然对缺失数据的分析本身就是一个具有挑战性的问题，但使用可扩展到大型数据集的重权重和估算方法的传统由来已久。我们在第2.5节中说明了无偏链接子集回归的条件是如何发展的，然后是对面值回归分析进行简单的渐进调整，与允许在存在缺失数据的情况下基于观察数据进行分析的假设类似。

### 2.2联动数据结构

​       用于记录链接的独立数据集的链接数据结构将该问题与数据丢失或测量错误的问题区分开来。在后一种情况下，分析单位周围没有歧义，但是与单位相关的值可以观察到有误差或没有误差完全被观察到了。通常，可以合理地假设随机测量误差或缺失指标在一个单元与另一个单元之间是独立的，或者在一些已识别的单元簇之间是独立的。然而，在记录链接中，记录是否链接到另一条记录，或链接到哪条记录，必要地影响其他记录的链接方式，但注意力被限制在每个可链接记录集块内时也是如此。记录的不同配对会导致结果分析的不确定性，即使所有相关结果值都被视为固定值。一个关键问题是如何适当地适应这种相互依赖单元模糊性，而不是控制与识别单元相关的输出变量的随机机制。由于链接数据结构，没有明确说明这种相互依赖性的任何建模方法可能难以从一般意义上证明其合理性。此外，与实现相关的一个问题是如何处理两个或多个记录集之间的这种相互依赖所必需的组合学。

#### 2.2.1 定义

现在，我们提供两个独立数据集基础上的链接是数据结构正式描述。该定义可以很容易地推广到涉及三个或更多数据集的情况。分别用大小为
$$
n_A和n_B
$$
的A和B表示单独的数据集。用
$$
a\in A
$$
表示A中的任意记录，类似于
$$
b\in B
$$


如果是任意固定整数，则表示
$$
a\in A
$$


所指的真实实体。

如果
$$
i_a = i_b
$$
则对于
$$
a \in A
$$
和
$$
b \in B
$$
则记录对（ab)被称为匹配，在这种情况下，a和b都被称为A和B之间的匹配记录。如果对于所有的
$$
b\in B有i_a\neq i_b
$$
则a是不匹配的记录。类似地，对于B中的b。我们应该参考
$$
{\Lambda}_{AB} = \{i_a;a\in A\}\cup\{i_b;b\in B\}
$$
作为A和B之间的链接数据结构，除非存在允许精确匹配的唯一标识符，否则链接数据结构是未知的。A和B之间记录链接的结构可以看作是一个估计的链接数据结构，表示为
$$
{\widehat\Lambda}_{AB}=\{\widehat i_a;a\in A\}\cup\{\widehat i_b;b\in B\}
$$
其中
$$
\widehat i_a = \widehat i_b
$$
提供（ab)是一对链接记录。

​      当只有两个数据集A和B时，链接数据结构可以由
$$
n_A \times n_B
$$
匹配矩阵
$$
\omega
$$
表示

其中
$$
{\omega}_{ij}=1
$$
如果在A中的第i个记录和B中的第j个记录是一对匹配，否则

***因为下文中有很多字母和字符，所以从下文开始中文和字母字符都在$$里面写，除标题外其他默认居中对齐***


$$
{\omega}_{ij}=
$$

$$
我们假设已删除重复记录，因为{\sum}_j{\omega}_{ij}\leq 1 和{\sum}_i{\omega}_{ij}\leq 1，用\Omega表示匹配矩阵空间，这个空间包含了所有可能的\omega。由于每个不同的\omega\\对应于不同的链路数据结构{\Lambda}_{AB},如果i_a和i_b的值不相关，则空间\Omega有效地定义了链接数据结构的空间。
$$

$$
设\omega 是任意记录对（ab）的匹配指示符。设M(\omega)=\{(ab);{\omega}_{ab}=1,a\in A，b\in B\}是A和B之间的\\匹配集合。设\cup_A(\omega)是A中不匹配记录的集合，\cup_B(\omega)是B中不匹配记录的集合。在没有重复记录的情况下，对应于\omega的子矩阵\\是置换矩阵,其可以由单位矩阵的列（或行）的置换给出。这是匹配矩阵表示的一个有用属性。设 \widehat\omega=\omega_L是链接矩阵，\\其中如果(ab)是一对链接记录，则{\omega}_{L,ab}=1,否则\omega = 0。设A_L由来自A的链接记录组成，B_L由来自B的链接记录组成。\\记录链接可视为M，\cup_A和\cup_B的产量估计，其中\widehat M=M(\omega_L)=\{(ab);\omega_{L,ab}=1,a\in A_L,b\in B_L\},\\并且各自有\widehat \cup_A=A或者A_L和\widehat \cup_B = B或者B_L。\\
$$

$$
我们通常观察到的链接和匹配之间的术语上的明显区别：匹配（ab)意味着\omega_{ab}=1并且事实上i_a=i_b\\一个链接(ab)意味着\widehat \omega_{ab}=\omega_{L,ab}=1,可能匹配也可能不匹配。
$$

$$
用\delta_{ab}表示a\in A和b\in B 之间单独比较数据，供二级分析员使用。设G为可用\delta_{ab}的集合。为了区分，\\让\delta_{a}^*和\delta_{b}^*是执行记录链接的数据提供者可访问的完全比较数据。在C-PR链接中，\delta_a^*包含\\年龄、性别、姓名、出生日期、邮政编码等。不是所有的这些都会被释放。事实上，即使其中一些因素，\\例如年龄和性别，也很可能不会被指定为关键变量。
$$

$$
作为可用比较数据的可能示例，\delta_{ab}可以是总结a如何与b进行绝对或相对比较的值。特别的，如果a和b\\被认为彼此一致，则一致指示符由\delta_{ab}=1给出，否则由\delta_ab=0给出。链路指示器，其中\delta_{ab}=1,当且仅当\omega_{L,ab}=1,可视为特殊协议指示符，\\不仅涉及A和B之间的比较，还涉及是否将它们联系起来的决定。例如，从表2.1的确定性通过，如果a和b在所有相关关键变量方面\\彼此相等，则可以设置一致指示符\delta_{ab}=1。其中\delta_{ab}=1和\delta_{ab'}=1也许会出现，尽管b\neq b'\in B。然而，如果\delta_{ab}是来自相同通道的指示符，\\则通常不允许b=b'的\delta_{ab}=\delta_{ab'}=1,因此\delta_{ab}=1现在表示唯一一致。
$$

$$
作为最小可用比较数据的场景，让辅助分析仅给定链接数据集，但是没有任何无链接记录，G将会是\\链接矩阵\omega_L的数量，而不是其他。
$$

#### 2.2.2 匹配空间的协议划分

$$
随着数据集大小的增加，匹配空间\Omega的完整枚举很快失去控制。为了便于有效的部分枚举，可以引入\Omega 的合理划分，\\并且在某些假设的统计模型下仅处理其中\omega 最可能的子空间。下面我们描述\Omega的一致分割，并考虑它的一些含义。
$$

$$
在不失一般性的情况下，设D为由第二分析员基于可用比较数据G定义的一致矩阵，其中D_{ab}=1,\\
如果记录a\in A与b\in B'一致',否则D=0。例如，我们有D_{n\times n}=\omega_L提供的最小信息，\\其中n=|A_L|=|B_L|。或者，如果另外提供了A和B未链接的记录，则可以使\\D_{n\times n}=\omega_L。如果Fellegi-Sunter(FS)范式（Fellegi和Sunter，1969)下\\提供来自概率记录链接的权重\lambda_{ab}，则可以将一致性定义为如果\lambda_{ab}超过某个阈值的情况。
$$

$$
设\kappa = {\sum}_i{\sum}_jD_{ij}是D中的总协议数。对任意的\omega \in \Omega,设d = {\sum}_a{\sum}_bD_{ab}\omega_{ab}是匹配协议数，\\其中(\omega_{ab},D_{ab})=(1,1),即，根据\omega匹配且根据D彼此一致的记录的编号对。例如，假设D_{n\times n}和一一匹配\\,因此，每个\omega必然是一个置换矩阵，我们还需要附加的(\omega_{ab},D_{ab})=(1,0)的n-d记录对，\\(\omega_{ab},D_{ab})=(0,1)的k-d记录对，以及(\omega_{ab},D_{ab})=(0,0)的n^2-n-(k-d)记录对。
$$

$$
设\Omega_0是达到最大值的d的集合，用d_0表示。\Omega_0中的矩阵被称为最一致匹配矩阵（MAMM_s)。\\例如，在一一链接和一一匹配下，其中D也是置换矩阵，并且\kappa=n,只有一个d_0=n的MAMM，\\即，\omega=D。更一般地，在一一链接下，D可以是一个具有\kappa\geq n。只要D允许，一个一一链接的\\MAMM可以有(\omega_{ab},D_{ab})=(1,1)中的n个元素,(\omega_{ab},D_{ab})=(1,0)中的0个元素，\\(\omega_{ab},D_{ab})=(0,1)中的\kappa-n个元素，以及(\omega_{ab},D_{ab})=(0,0)中的n^2-\kappa个元素。
$$

$$
只要这样的矩阵存在，设\Omega_1包含被d_0-1给出的所有带有协同协定的\omega s。这不一定总是可能。\\例如，在一一链接和意义匹配的情况下，D和a之间的下一个最高可能的一致数是n-2,而不是n-1，\\因此，我们有\Omega_1 = \phi。设\Omega_k是d_0-k给出的符合数的匹配矩阵集。\Omega的协议分割由下式给出：
$$

$$
\Omega(D)=\cup_{k=0}^{d_0}\Omega_k
$$

$$
如果对记录链接程序由一定的信心，那么实践中的任何建模方法都会使得\omega的可能性在\Omega的一致性\\分割上随k而减小，这似乎是很自然的。事实上，在最小比较数据的情况下，其中D=G=\omega_L,\\二级分析员将不会有信息对来自相同\Omega_k的\omega放置不同的可能性。此外，设\omega\in \Omega_k\\和\omega'\in \Omega_{k+1},使得它们仅在一对(ab)中不同，其中D_{ab}=1,\omega_{ab}=1，\\但是\omega_{ab}’=0。两者之间基于D的似然比由下式给出：
$$

$$
LR(\omega',\omega;D)=\frac{L(\omega';D)}{L(\omega;D)} = \frac {Pr(D|D_ab=1;\omega')} {Pr(D|D_ab=1;\omega)}·\frac{Pr(D_{ab}=1;\omega')}{Pr(D_{ab}=1;\omega)}
$$

$$
既然现在\omega和\omega'在除(ab)之外的任何地方都是一致的，那么最简单的建模方法可以假设
$$

$$
LR(\omega',\omega;D)=\frac{Pr(D_{ab}=1;\omega_{ab}'=0)}{Pr(D_{ab}=1;\omega_{ab}=1)}
$$

显然，作为二次分析的最低可行性要求，必须提供某些链接准数据，已便能够对该比率建模，从而建立尊重链接数据结构的方法。
